# https://www.seoul.go.kr/seoul/autonomy_sub.do
TEST_DONG_INFO = {
    '강남구':[
        '신사동'
    ],
    '강동구':[
        '강일동'
    ]
}
DONG_INFO = {
    '강남구':[
        '신사동','압구정동','논현동','청담동','삼성동',
        '대치동','역삼동','도곡동','개포동','일원동',
        '수서동', '세곡동','자곡동','율현동'
    ],
    '강동구':[
        '강일동','상일동','고덕동', '명일동','암사동',
        '천호동','성내동','길동','둔촌동'
    ],
    '강북구':[
        '미아동','번동','수유동','우이동'
    ],
    '강서구':[
        '염창동','등촌동','화곡동','내발산동','가양동',
        '마곡동','외발산동','공항동','과해동','오곡동',
        '오쇠동','방화동', '개화동'
    ],
    '관악구':[
        '봉천동','남현동','신림동'
    ],
    '광진구':[
        '중곡동','능동','구의동','광장동','자양동',
        '화양동','군자동'
    ],
    '구로구':[
        '신도림동','구로동','가리봉동','고척동','개봉동',
        '오류동','천왕동','향동','온수동','궁동'
    ],
    '금천구':[
        '가산동','독산동', '시흥동'
    ],
        '노원구':[
        '월계동','공릉동','하계동','중계동','상계동'
    ],
    '도봉구':[
        '쌍문동','창동','방학동','도봉동'
    ],
    '동대문구':[
        '신설동','용두동','제기동','전농동','답십리동',
        '장안동','청량리동','회기동','회경동','이문동'
    ],
    '동작구':[
        '노량진동','본동','상도동','상도1동','흑석동',
        '사당동','동작동','대방동','신대방동'
    ],
    '마포구':[
        '아현동','공덕동','염리동','신공덕동','도화동',
        '마포동','용강동','토정동','대흥동','신수동',
        '노고산동','구수동','현석동','신정동','창전동',
        '상수동','하중동','당인동','서교동','동교동',
        '합정동','망원동','연남동','성산동', '중동',
        '상암동'
    ],
    '서대문구':[
        '충정로2가','충정로3가','합동','미근동','북아현동',
        '천연동','냉천동','옥천동','영천동','현저동',
        '북아현동','대신동','대현동','신촌동','봉원동',
        '창전동', '연희동','홍제동','남가좌동','북가좌동'
    ],
    '서초구':[
        '서초동','방배동','잠원동','반포동','양재동',
        '우면동','원지동','내곡동','염곡동','신원동'
    ],
    '성동구':[
        '하왕십리동','상왕십리동','도선동','홍익동','마장동',
        '사근동','행당동','응봉동','금호동1가','금호동2가',
        '금호동3가','금호동4가','옥수동','성수동1가','성수동2가',
        '송정동','용답동'
    ],
    '성북구':[
        '성복동','성북동1가','동소문동1가','동소문동4가','삼선동1가',
        '삼선동2가','삼선동3가','삼선동4가','삼선동5가','돈암동',
        '동소문동2가','동소문동3가','동소문동5가','동선동1가','동선동2가',
        '동선동3가','동선동4가','동선동5가','동소문동6가','동소문동7가',
        '안암동1가','안암동2가','안암동3가','안암동4가','안암동5가',
        '보문동1가', '보문동2가','보문동3가','보문동4가','보문동5가',
        '보문동6가','보문동7가', '정릉동', '길음동','하월곡동',
        '종암동','상월곡동','장위동','석관동'
    ],
    '송파구':[
              '풍납동','거여동','마천동','방이동','오금동',
        '송파동','석천동','삼전동','가락동','문정동',
        '장지동','잠실동','신천동'
    ],
    '양천구':[
        '목동','신월동','신정동'
    ],
    '영등포구':[
        '영등포동','신길동','영등포동1가','영등포동2가','영등포동3가',
        '영등포동4가','영등포동5가','영등포동6가','영등포동7가','영등포동8가',
        '여의도동','당산동1가','당산동2가','당산동3가','당산동4가',
        '당산동5가','당산동6가','당산동','도림동','문래동1가',
        '문래동2가','문래동3가','문래동4가','문래동5가','문래동6가',
        '양평동','양평동1가','양평동2가','양평동3가','양평동4가',
        '양평동5가','양평동6가','신길동','대림동'
    ],
    '용산구':[
        '후암동','용산동2가','용산동4가','갈월동','남영동',
        '동자동','용산동1가','청파동1가','청파동2가','청파동3가',
        '서계동','원효로1가','원효로2가','문배동','신계동',
        '원효로3가','원효로4가','신창동','산천동','청암동',
        '효창동','용문동','도원동','한강로1가','한강로2가',
        '한강로3가','용산동3가','용산동5가','이촌동','이태원동',
        '한남동','서빙고동','동빙고동','주성동','용산동6가',
        '보광동'
    ],
    '은평구':[
        '녹번동','불광동','갈현동','구산동','대조동',
        '응암동','역촌동','신사동','증산동','수색동',
        '진관동'
   ],
    '종로구':[
 '청운동','신교동','궁정동','효자동','창성동'
,'통의동','적선동','통인동','누상동','누하동','옥인동'
,'체부동','필운동','내자동','사직동','도렴동','당주동'
,'내수동','세종로','신문로1가','신문로2가','청진동'
,'서린동','수송동','중학동','종로1가','공평동'
,'관훈동','견지동','와룡동','권농동','운니동'
,'익선동','경운동','관철동','인사동','낙원동'
,'종로2가','팔판동','삼청동','안국동','소격동'
,'화동','사간동','송현동','가회동','재동','계동'
,'원서동'
,'훈정동'
,'묘동'
,'봉익동'
,'돈의동'
,'장사동'
,'관수동'
,'종로3가'
,'인의동'
,'예지동'
,'원남동'
,'연지동'
,'종로4가'
,'효제동'
,'종로5가'
,'종로6가'
,'이화동'
,'연건동'
,'충신동'
,'동숭동'
,'혜화동'
,'명륜1가'
,'명륜2가'
,'명륜4가'
,'명륜3가'
,'창신동'
,'숭인동'
,'교남동'
,'평동'
,'송월동'
,'홍파동'
,'교북동'
,'행촌동'
,'구기동'
,'평창동'
,'부암동'
,'홍지동'
,'신영동'
,'무악동'],
    '중구':[
        '소공동', '북창동', '태평로2가', '남대문로2가', '서소문동',
        '정동', '의주로1가', '남창동', '남대문로3가', '남대문로4가',
        '남대문로5가', '봉래동1가', '봉래동2가', '충정로1가', '순화동',
        '명동1가', '명동2가', '충무로1가', '충무로2가', '저동1가',
        '남산동1가', '남산동2가', '남산동3가', '태평로1가', '무교동',
        '다동', '을지로1가', '을지로2가', '삼각동', '남대문로1가',
        '수하동', '장교동', '수표동', '회현동1가', '회현동2가',
        '회현동3가','필동1가', '필동2가', '필동3가', '남학동',
        '주자동', '예장동', '충무로3가', '충무로4가', '충무로5가',
        '장충동1가', '장충동2가', '묵정동','광희동1가', '광희동2가',
        '쌍림동', '을지로6가', '을지로7가', '예관동', '오장동',
        '을지로3가', '을지로4가', '을지로5가', '주교동', '방산동',
        '입정동', '산림동', '초동', '인현동', '저동2가',
        '무학동', '흥인동','신당동','황학동','중림동',
        '의주로2가', '만리동1가','만리동2가'
    ],
    '중랑구':[
        '면목동','상봉동','중화동','묵동','망우동',
        '신내동'
    ]
}                                                                                                         162,1         84%                                                                                                                              60,1          16%